---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.ForwardIterator
source: html/57cc301a-de8e-2c20-cdbc-e09e776df0b5.htm
---
# Autodesk.Revit.DB.PlanTopologySet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PlanTopologySetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.